---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperature.#ctor(System.Double,System.Double,System.Double)
source: html/66202070-f336-1db6-4bfb-7ae8577a0651.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperature.#ctor Method

Creates a new fluid temperature with given temperature, dynamic viscosity and density.

## Syntax (C#)
```csharp
public FluidTemperature(
	double temperature,
	double viscosity,
	double density
)
```

## Parameters
- **temperature** (`System.Double`) - The temperature value.
- **viscosity** (`System.Double`) - The dynamic viscosity value.
- **density** (`System.Double`) - The density value.